---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctPressureDropData.PressureDrop
source: html/95dae130-a635-c9ff-07c9-7ecd24cbcefd.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData.PressureDrop Property

The pressure drop of the duct. Units: (kg/(ft·s²)).

## Syntax (C#)
```csharp
public double PressureDrop { get; set; }
```